const MORSE_TABLE = {
    '.-':     'a',
    '-...':   'b',
    '-.-.':   'c',
    '-..':    'd',
    '.':      'e',
    '..-.':   'f',
    '--.':    'g',
    '....':   'h',
    '..':     'i',
    '.---':   'j',
    '-.-':    'k',
    '.-..':   'l',
    '--':     'm',
    '-.':     'n',
    '---':    'o',
    '.--.':   'p',
    '--.-':   'q',
    '.-.':    'r',
    '...':    's',
    '-':      't',
    '..-':    'u',
    '...-':   'v',
    '.--':    'w',
    '-..-':   'x',
    '-.--':   'y',
    '--..':   'z',
    '.----':  '1',
    '..---':  '2',
    '...--':  '3',
    '....-':  '4',
    '.....':  '5',
    '-....':  '6',
    '--...':  '7',
    '---..':  '8',
    '----.':  '9',
    '-----':  '0',
};

function decode(expr) {
    let arr = expr.match(/.{10}/g); /* Забиваем строку в массив, разбивая на элементы по 10 знаков */
    let res = [];
    for (let i = 0; i < arr.length; i++) {
        let res1 = arr[i].replace(/^0+/gm, "").replace(/10/gm, ".").replace(/11/gm, "-");
        if (arr[i] === "**********") {
            res.push(" ");
        } else {
            res.push(MORSE_TABLE[res1]);
        }
    }
    return res.join("");
}

module.exports = {
    decode
}